MPS/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКартинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>URLКартинки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URLПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодностиВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Создан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обновлен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаРеальная</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Catalogs/Номенклатура/Forms/РазблокированиеРеквизитов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	РазрешитьРедактированиеНаименование = Истина;
	РазрешитьРедактированиеГруппаДоступа                      = Истина;
	РазрешитьРедактированиеШтрихкод                        = Истина;
	РазрешитьРедактированиеАртикул                = Истина;
	РазрешитьРедактированиеПроизводитель                    = Истина;
	РазрешитьРедактированиеТоварнаяКатегория                    = Истина;
	РазрешитьРедактированиеURLКартинки                    = Истина;
	РазрешитьРедактированиеURLПродукта                    = Истина;
	РазрешитьРедактированиеСрокГодностиВДнях                    = Истина;
	РазрешитьРедактированиеЦенИСебестоимости                    = Истина;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеНаименование Тогда
		Результат.Добавить("Наименование");
	КонецЕсли;
	
	Если РазрешитьРедактированиеГруппаДоступа Тогда
		Результат.Добавить("ГруппаДоступа");
	КонецЕсли;
	
	Если РазрешитьРедактированиеШтрихкод Тогда
		Результат.Добавить("Штрихкод");
	КонецЕсли;
	
	Если РазрешитьРедактированиеАртикул Тогда
		Результат.Добавить("Артикул");
	КонецЕсли;
	
	Если РазрешитьРедактированиеПроизводитель Тогда
		Результат.Добавить("Производитель");
	КонецЕсли;
	
	Если РазрешитьРедактированиеТоварнаяКатегория Тогда
		Результат.Добавить("ТоварнаяКатегория");
	КонецЕсли;
	
	Если РазрешитьРедактированиеURLКартинки Тогда
		Результат.Добавить("URLКартинки");
	КонецЕсли;
	
	Если РазрешитьРедактированиеURLПродукта Тогда
		Результат.Добавить("URLПродукта");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСрокГодностиВДнях Тогда
		Результат.Добавить("СрокГодностиВДнях");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЦенИСебестоимости Тогда
		Результат.Добавить("Цена");
		Результат.Добавить("ЦенаРеальная");
		Результат.Добавить("Себестоимость");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
